{
  "intents": [
      {
          "intent": "tamil_nadu_agriculture_scheme",
          "examples": [
              "What are the new schemes for agriculture in Tamil Nadu?",
              "Tell me about support for farmers",
              "Is there any funding for agriculture?"
          ],
          "criteria": "Detects queries about Tamil Nadu's agriculture schemes.",
          "response": "The Agriculture and Farmer's Welfare Department in Tamil Nadu has introduced initiatives for farmer welfare and infrastructure improvement."
      },
      {
          "intent": "nagore_neithal_heritage_park",
          "examples": [
              "What is the Nagore Neithal Heritage Park?",
              "Tell me about the heritage park scheme",
              "What are the features of Nagore Neithal Park?"
          ],
          "criteria": "Detects queries about the Nagore Neithal Heritage Park.",
          "response": "The Nagore Neithal Heritage Park is being developed as a heritage conservation area under the State Innovation Fund."
      },
      {
          "intent": "fisheries_seasonal_assessment",
          "examples": [
              "How does Tamil Nadu assess fishery spawning seasons?",
              "Is there a scheme for fishery management?",
              "Tell me about sustainable fishing schemes"
          ],
          "criteria": "Recognizes queries on seasonal fishery assessments in Tamil Nadu.",
          "response": "The Fisheries Department is conducting a spawning seasonality assessment for sustainable fishery management along the Tamil Nadu coast."
      },
      {
          "intent": "solar_ev_charging_stations",
          "examples": [
              "Are there solar EV charging stations in Tamil Nadu?",
              "Tell me about EV charging schemes",
              "Is there support for EV infrastructure?"
          ],
          "criteria": "Identifies queries about solar-powered EV charging stations.",
          "response": "The Tamil Nadu Energy Department is establishing solar-powered electric vehicle (EV) charging stations under the State Innovation Fund."
      },
      {
          "intent": "biodiversity_centers_in_schools",
          "examples": [
              "What are biodiversity centers in schools?",
              "Does Tamil Nadu have environmental education schemes?",
              "Tell me about school biodiversity programs"
          ],
          "criteria": "Recognizes queries about biodiversity centers in schools.",
          "response": "Tamil Nadu is establishing biodiversity conservation centers in schools and colleges to promote environmental awareness among students."
      },
      {
          "intent": "marine_fauna_app",
          "examples": [
              "What is the marine fauna identification app?",
              "Tell me about Tamil Nadu's marine conservation tools",
              "Is there a tool for marine animal identification?"
          ],
          "criteria": "Detects queries about Tamil Nadu's marine fauna identification app.",
          "response": "Tamil Nadu has launched a bilingual mobile app to help identify terrestrial and marine fauna, supporting wildlife conservation efforts."
      },
      {
          "intent": "dna_mollusk_identification",
          "examples": [
              "How does Tamil Nadu identify protected mollusks?",
              "Tell me about the mollusk DNA identification tool",
              "What is DNA mini-barcode for mollusks?"
          ],
          "criteria": "Identifies queries about the mollusk DNA identification tool.",
          "response": "Tamil Nadu has developed a DNA mini barcode identification tool to help protect marine mollusks and control wildlife crimes."
      },
      {
          "intent": "organic_fertilizer_granulation_machine",
          "examples": [
              "What is the organic fertilizer machine scheme?",
              "Tell me about fertilizer schemes in Tamil Nadu",
              "Is there support for organic fertilizer production?"
          ],
          "criteria": "Recognizes queries on the organic fertilizer granulation machine scheme.",
          "response": "Tamil Nadu supports large-scale organic fertilizer production through the establishment of a granulation machine for enriched vermicasting."
      },
      {
          "intent": "siddha_wellness_switch",
          "examples": [
              "What is the Siddha Wellness scheme?",
              "Tell me about the SWITCH program",
              "Is there traditional medicine support in Tamil Nadu?"
          ],
          "criteria": "Detects queries on Siddha Wellness integration.",
          "response": "The Siddha Wellness Integration to Community Health (SWITCH) scheme focuses on integrating traditional Siddha practices into community healthcare."
      },
      {
          "intent": "siddha_geriatric_care_sigma",
          "examples": [
              "What is the SIGMA scheme?",
              "Tell me about geriatric Siddha care",
              "Does Tamil Nadu support traditional medicine for the elderly?"
          ],
          "criteria": "Identifies queries on Siddha geriatric healthcare.",
          "response": "The SIGMA scheme focuses on Siddha Geriatric Health Care, particularly for managing musculoskeletal disorders in the elderly."
      },
      {
          "intent": "trauma_registry_software",
          "examples": [
              "What is the trauma registry software?",
              "Tell me about trauma care schemes",
              "Is there support for trauma monitoring?"
          ],
          "criteria": "Detects queries on Tamil Nadu’s trauma registry software.",
          "response": "Tamil Nadu has introduced a trauma registry software system to centralize and monitor trauma cases across TAEI centers."
      },
      {
          "intent": "population_health_registry",
          "examples": [
              "What is the Population Health Registry?",
              "Tell me about health profiling in Tamil Nadu",
              "Is there a health database in Tamil Nadu?"
          ],
          "criteria": "Recognizes queries on the Population Health Registry.",
          "response": "Tamil Nadu's Population Health Registry aims to profile individuals for targeted healthcare delivery and tracking."
      },
      {
          "intent": "hpv_vaccination_pilot",
          "examples": [
              "What is the HPV vaccination scheme?",
              "Tell me about pilot vaccination projects",
              "Is there an HPV program in Tamil Nadu?"
          ],
          "criteria": "Identifies queries on the HPV vaccination pilot project.",
          "response": "Tamil Nadu has initiated an HPV vaccination pilot program for girls aged 12-14 in selected districts."
      },
      {
          "intent": "digital_valuation_system",
          "examples": [
              "What is the Digital Valuation System?",
              "Tell me about the DVS project",
              "Is there a scheme for digital valuation in universities?"
          ],
          "criteria": "Detects queries on the Digital Valuation System in universities.",
          "response": "The Digital Valuation System (DVS) is implemented at universities like Anna and Thiruvalluvar, enhancing digital education assessments."
      },
      {
          "intent": "tamil_nadu_technology_hub",
          "examples": [
              "What is the Tamil Nadu Technology Hub?",
              "Tell me about the iTamil Nadu Tech Hub",
              "Is there a technology innovation hub in Tamil Nadu?"
          ],
          "criteria": "Recognizes queries about the Tamil Nadu Technology Hub.",
          "response": "The iTamil Nadu Technology Hub, a State Innovation Fund project, fosters tech innovation and startups across Tamil Nadu."
      },
      {
          "intent": "self_help_group_food_processing",
          "examples": [
              "Is there support for self-help groups?",
              "Tell me about food processing training for SHGs",
              "Are there incubation centers for SHGs?"
          ],
          "criteria": "Detects queries about food processing schemes for Self Help Groups (SHGs).",
          "response": "Tamil Nadu provides training and incubation for SHGs in food processing under the State Innovation Fund."
      },
      {
          "intent": "ability_services_super_app",
          "examples": [
              "What is the Ability Services Platform?",
              "Tell me about the super app for differently abled",
              "Is there support for differently abled services?"
          ],
          "criteria": "Identifies queries on the Ability Services Super App for differently abled individuals.",
          "response": "Tamil Nadu's Ability Services Super App offers a comprehensive platform for resources and support for differently abled individuals."
      },
      {
          "intent": "geographical_information_system_gis",
          "examples": [
              "What is the GIS division in Chennai?",
              "Tell me about the GIS scheme",
              "Is there support for GIS in Chennai?"
          ],
          "criteria": "Recognizes queries on the GIS initiative in Chennai.",
          "response": "Tamil Nadu is establishing a GIS Division in Greater Chennai Corporation to enhance urban planning and data management."
      }
      ,
      {
      "intent": "constitution_article_1",
          "examples": [
              "What does Article 1 of the Indian Constitution state?",
              "Explain Article 1",
              "What is Article 1?"
          ],
          "criteria": "Recognizes queries about Article 1 of the Indian Constitution.",
          "response": "Article 1 of the Indian Constitution states that India, that is Bharat, shall be a Union of States. It also defines the territory of India."
      },
      {
          "intent": "constitution_article_2",
          "examples": [
              "What does Article 2 of the Indian Constitution state?",
              "Explain Article 2",
              "What is Article 2?"
          ],
          "criteria": "Recognizes queries about Article 2 of the Indian Constitution.",
          "response": "Article 2 of the Indian Constitution empowers Parliament to admit or establish new States into the Union of India and allows it to determine the terms and conditions of such admission or establishment."
      },
      {
          "intent": "constitution_article_3",
          "examples": [
              "What does Article 3 of the Indian Constitution state?",
              "Explain Article 3",
              "What is Article 3?"
          ],
          "criteria": "Recognizes queries about Article 3 of the Indian Constitution.",
          "response": "Article 3 of the Indian Constitution allows Parliament to alter the boundaries of existing states, increase or decrease their areas, or change their names. However, this can only be done with the President's recommendation and after referring the proposal to the legislature of the affected state."
      },
      {
          "intent": "constitution_article_4",
          "examples": [
              "What does Article 4 of the Indian Constitution state?",
              "Explain Article 4",
              "What is Article 4?"
          ],
          "criteria": "Recognizes queries about Article 4 of the Indian Constitution.",
          "response": "Article 4 of the Indian Constitution clarifies that laws made under Articles 2 and 3 are not to be considered as amendments to the Constitution under Article 368, meaning they do not require a constitutional amendment procedure."
      },
      {
          "intent": "constitution_article_5",
          "examples": [
              "What does Article 5 of the Indian Constitution state?",
              "Explain Article 5",
              "What is Article 5?"
          ],
          "criteria": "Recognizes queries about Article 5 of the Indian Constitution.",
          "response": "Article 5 of the Indian Constitution deals with citizenship at the commencement of the Constitution, defining who shall be deemed as a citizen of India at that time."
      }
  ]
}
